# Size Property (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ElectricalSystemSet..::..Size Property
ElectricalSystemSet Class See Also
---
Returns the number of objects that are in the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public virtual int Size { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Size As Integer
	Get
```

Visual C++
---
```text
public:
virtual property int Size {
	int get ();
}
```

# See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace